# 技术文档-KBQA

​	KBQA的技术文档分为两部分一个是KBQA的整体技术路线，以及技术路线中各个模型的介绍。

## 1 技术路线

​	该技术路线主要将KBQA分为三部分，实体识别与实体链接，关系识别，sparql查询，其中每个部分分为一到多种方法实现。

​	当用户输入一个句子之后，问答系统会从用户的句子中抽取对应的实体提及，然后根据抽取的实体提及通过实体链接映射到知识图谱中的实体。同时，系统也会从句子中识别到用户想要问的关系，然后结合实体和关系，即可使用sparql语言从知识图谱中查询得到对应的结果。

​	样例如下：

​	当用户问：**奥迪R8的最高车速是多少公里** 时，可以通过命名实体识别的方法识别到**奥迪R8**，然后根据知识图谱中的数据，可以直接找到 奥迪**R8(http://www.demo.com/kg/item/train#s511)** 这个实体。通过关系识别，可以知道用户问的是**最高车速(http://www.demo.com/predicate/最高车速(km/h)) **该关系，因此可以根据以下sparql语句查询对应的结果：

```sparql
PREFIX p:<http://www.demo.com/predicate/>
PREFIX item:<http://www.demo.com/kg/item/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>

SELECT ?car ?time ?object ?name
WHERE {
    ?car p:CarTrain <http://www.demo.com/kg/item/train#s511>;
    p:上市时间 ?time;
    <http://www.demo.com/predicate/最高车速(km/h)> ?object;
    rdfs:label ?name.
}order by DESC(?time)
```

​	结果如下

| "car"                                        | "time"    | "object" | "name"                                     |
| -------------------------------------------- | --------- | -------- | ------------------------------------------ |
| "http://www.demo.com/kg/item/car#spec_30129" | "2017.06" | "320"    | "奥迪R8 2017款 V10 Coupe"                  |
| "http://www.demo.com/kg/item/car#spec_30130" | "2017.06" | "318"    | "奥迪R8 2017款 V10 Spyder"                 |
| "http://www.demo.com/kg/item/car#spec_26925" | "2016.07" | "330"    | "奥迪R8 2016款 V10 Coupe Performance"      |
| "http://www.demo.com/kg/item/car#spec_17195" | "2013.1"  | "314"    | "奥迪R8 2014款 5.2 FSI quattro"            |
| "http://www.demo.com/kg/item/car#spec_17305" | "2013.1"  | "311"    | "奥迪R8 2014款 Spyder 5.2 FSI quattro"     |
| "http://www.demo.com/kg/item/car#spec_17306" | "2013.1"  | "300"    | "奥迪R8 2014款 4.2 FSI quattro"            |
| "http://www.demo.com/kg/item/car#spec_17307" | "2013.1"  | "300"    | "奥迪R8 2014款 Spyder 4.2 FSI quattro"     |
| "http://www.demo.com/kg/item/car#spec_14300" | "2012.11" | "316"    | "奥迪R8 2013款 5.2 FSI quattro 中国专享型" |
| "http://www.demo.com/kg/item/car#spec_11394" | "2011.11" | "316"    | "奥迪R8 2012款 5.2 FSI quattro 限量版"     |
| "http://www.demo.com/kg/item/car#spec_6071"  | "2011.05" | "313"    | "奥迪R8 2011款 Spyder 5.2 FSI quattro"     |
| "http://www.demo.com/kg/item/car#spec_4747"  | "2010.06" | "316"    | "奥迪R8 2010款 5.2 FSI quattro"            |

​	再根据自然语言生成模块，找到最新的车的结果，组织成语言输出，得到结果如下：

```
奥迪R8 2017款 V10 Coupe 的最高车速是 320km/h
奥迪R8 2017款 V10 Spyder 的最高车速是 318km/h
```

​	下面介绍各个模块的详细技术实现。每个模块的介绍主要从三个方面开展，数据准备，模型介绍，效果评估

## 2 实体识别与实体链接

### 2.1 实体识别

​	命名实体识别技术在系统中主要应用与识别句子中的汽车实体，这是将句子链接到知识图谱的第一步，使用的方法主要应用了基于词典的匹配以及bert命名实体识别模型。因为汽车领域的特殊性，用户提问汽车实体提及可能对应的是汽车品牌或者车型，在做后续问答的时候，都可能要对应的回答，因此合并成一个，下称汽车实体，也就是实体识别部分只识别汽车实体。

#### 2.1.1 数据准备

​	数据准备方面分为两部分，一个是词典数据准备，该部分主要从知识图谱中抽取所有的汽车品牌，生产厂商，车系等三种词典合并成一个大的汽车词典。另外一部分是bert命名实体识别模型的训练数据，下面主要介绍训练数据集的构建。

​	网上有很多通用命名实体识别的公开数据集，但是关于汽车领域的数据却没有，因此该数据级需要自行构建。构建思路为通过网上爬取汽车相关的问题，然后通过人工标注，构建一份数据集。

1.  构建爬取query集合

   通过从知识图谱中抽取汽车车系以及属性的组合作为query。如以下为知识图谱中的三元组数据

   ```
   奔驰E级AMG	上市时间	2010.08
   奔驰E级AMG	供油方式	多点电喷
   奔驰E级AMG	前制动器类型	通风盘式
   奔驰E级AMG	前悬架类型	四连杆独立悬架
   奔驰E级AMG	前轮胎规格	245/40 R18
   奔驰E级AMG	前轮距	-
   奔驰E级AMG	助力类型	电子液压助力
   奔驰E级AMG	厂商	梅赛德斯-AMG
   ......
   奥迪A6L新能源	工信部续航里程	50
   奥迪A6L新能源	工信部综合油耗	2.3
   奥迪A6L新能源	座位数	5
   奥迪A6L新能源	快充电量	-
   奥迪A6L新能源	挡位个数	8
   奥迪A6L新能源	排量	2
   奥迪A6L新能源	排量	1984
   奥迪A6L新能源	整备质量	-
   奥迪A6L新能源	整车质保	待查
   奥迪A6L新能源	最大功率	155
   奥迪A6L新能源	最大功率	180
   奥迪A6L新能源	最大功率转速	-
   ```

   那么去掉obect可以得到对应的query

   ```
   奔驰E级AMG	上市时间
   奔驰E级AMG	供油方式
   奔驰E级AMG	前制动器类型
   奔驰E级AMG	前悬架类型
   奔驰E级AMG	前轮胎规格
   奔驰E级AMG	前轮距
   奔驰E级AMG	助力类型
   奔驰E级AMG	厂商
   ......
   奥迪A6L新能源	工信部续航里程
   奥迪A6L新能源	工信部综合油耗
   奥迪A6L新能源	座位数	
   奥迪A6L新能源	快充电量
   奥迪A6L新能源	挡位个数
   奥迪A6L新能源	排量
   奥迪A6L新能源	排量
   奥迪A6L新能源	整备质量
   奥迪A6L新能源	整车质保
   奥迪A6L新能源	最大功率
   奥迪A6L新能源	最大功率
   奥迪A6L新能源	最大功率转速
   ```

2. 根据query爬取数据

   如，根据query **"奔驰E级AMG	上市时间"**，在百度知道中搜索，得到结果如下

   ![1563692260751](../images/1563692260751.png)

   ​	那么就可以得到前五条数据（去除广告之后）。

   ```
   奔驰e43 amg什么时候国内能买到
   奔驰E级有没有AMG？
   奔驰E级和E级AMG哪个好
   探界者和奔驰E级AMG哪个好
   奔驰E级（进口）和E级AMG哪个好
   ```

3. 人工标注

   根据爬取到的数据，随机筛选出700条进行人工标注，标注方式采用BIEO标注方式。

   其中500条训练数据，200条测试数据。样例数据如下：

   ```
   汽   O
   车  O
   一  O
   般  O
   采  O
   用  O
   什  O
   么  O
   驱  O
   动  O
   方  O
   式  O
   
   奥  B
   迪  I
   A  I
   8  I
   L  E
      O
   需  O
   要  O
   多  O
   少  O
   公  O
   里  O
   保  O
   养  O
   ？  O
   
   本  B
   田  I
   锋  I
   范  E
   变  O
   速  O
   箱  O
   该  O
   用  O
   什  O
   么  O
   品  O
   质  O
   的  O
   油  O
   
   2  O
   0  O
   1  O
   1  O
   款  O
   奥  B
   迪  I
   a  I
   5  E
   是  O
   国  O
   几  O
   ?  O
   ```

#### 2.1.2 模型介绍

​	命名实体识别分使用技术有两种，一种是词典匹配，一个是bert命名实体识别，因词典匹配方法相对简单，因此先介绍词典匹配方法。

##### 2.1.2.1 词典匹配

​	首先构建汽车实体的汽车词典，然后加入到结巴分词的用户自定义词典中，那么在分词时，因为加入的词典原因，结巴分词在计算最佳分词路径的时候就会将新加入的汽车实体分割出来，那么就可以找到对应的实体提及。

##### 2.1.2.2 bert命名实体识别

​	bert是google在2018年10月发布的一个具有代表性的自然语言处理底层模型，该模型主要将句子进行表征，然后再根据对应的下游任务设计顶层结构来实现对应的功能。

​	给予bert的命名实体识别模型是使用预训练的bert模型对句子进行表征后，按照序列标注的方法，进行命名实体识别任务。结构如下（图片来源于[原论文](https://arxiv.org/pdf/1810.04805.pdf)）

​	![1563697024888](../images/1563697024888.png)

​	将句子以字形式进行切分得打Tok序列，通过bert进行表征，最终得到特征序列T，然后再对特征序列进行一个映射到label维度后加一个softmax层即可。

#### 2.1.3 效果评估

​	模型在测试上的表现效果如下：

| 实体 | precision | recall | f1   |
| ---- | --------- | ------ | ---- |
| 汽车 |           |        |      |



### 2.2 实体链接

​	

​	